# BeamSystemHasTooManyBeams Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BeamSystemFailures..::..BeamSystemHasTooManyBeams Property
BuiltInFailures..::..BeamSystemFailures Class See Also
---
A beam system is trying to create more than 500 beams. Please use multiple beam systems if more than 500 beams are desired.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BeamSystemHasTooManyBeams { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamSystemHasTooManyBeams As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BeamSystemHasTooManyBeams {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BeamSystemFailures Class
Autodesk.Revit.DB Namespace